###################################################################

# Created by write_sdc on Fri Nov 29 18:25:40 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current A
set_wire_load_mode top
set_wire_load_model -name tsmcwire -library lec25dscc25_TT
set_driving_cell -min -lib_cell dffacs1 [get_ports rst_n]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[191]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[190]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[189]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[188]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[187]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[186]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[185]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[184]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[183]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[182]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[181]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[180]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[179]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[178]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[177]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[176]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[175]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[174]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[173]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[172]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[171]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[170]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[169]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[168]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[167]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[166]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[165]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[164]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[163]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[162]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[161]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[160]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[159]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[158]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[157]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[156]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[155]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[154]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[153]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[152]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[151]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[150]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[149]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[148]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[147]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[146]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[145]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[144]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[143]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[142]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[141]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[140]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[139]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[138]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[137]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[136]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[135]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[134]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[133]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[132]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[131]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[130]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[129]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[128]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[127]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[126]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[125]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[124]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[123]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[122]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[121]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[120]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[119]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[118]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[117]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[116]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[115]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[114]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[113]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[112]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[111]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[110]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[109]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[108]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[107]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[106]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[105]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[104]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[103]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[102]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[101]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[100]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[99]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[98]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[97]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[96]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[95]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[94]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[93]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[92]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[91]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[90]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[89]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[88]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[87]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[86]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[85]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[84]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[83]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[82]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[81]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[80]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[79]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[78]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[77]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[76]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[75]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[74]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[73]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[72]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[71]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[70]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[69]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[68]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[67]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[66]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[65]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[64]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[63]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[62]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[61]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[60]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[59]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[58]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[57]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[56]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[55]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[54]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[53]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[52]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[51]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[50]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[49]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[48]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[47]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[46]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[45]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[44]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[43]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[42]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[41]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[40]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[39]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[38]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[37]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[36]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[35]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[34]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[33]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[32]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[31]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[30]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[29]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[28]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[27]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[26]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[25]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[24]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[23]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[22]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[21]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[20]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[19]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[18]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[17]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[16]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[15]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[14]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[13]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[12]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[11]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[10]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[9]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[8]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[7]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[6]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[5]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[4]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[3]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[2]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[1]}]
set_driving_cell -lib_cell dffacs1 [get_ports {in_data[0]}]
set_driving_cell -lib_cell dffacs1 [get_ports in_vld]
set_driving_cell -lib_cell dffacs1 [get_ports out_rdy]
set_fanout_load 10 [get_ports in_rdy]
set_fanout_load 10 [get_ports {out_data[191]}]
set_fanout_load 10 [get_ports {out_data[190]}]
set_fanout_load 10 [get_ports {out_data[189]}]
set_fanout_load 10 [get_ports {out_data[188]}]
set_fanout_load 10 [get_ports {out_data[187]}]
set_fanout_load 10 [get_ports {out_data[186]}]
set_fanout_load 10 [get_ports {out_data[185]}]
set_fanout_load 10 [get_ports {out_data[184]}]
set_fanout_load 10 [get_ports {out_data[183]}]
set_fanout_load 10 [get_ports {out_data[182]}]
set_fanout_load 10 [get_ports {out_data[181]}]
set_fanout_load 10 [get_ports {out_data[180]}]
set_fanout_load 10 [get_ports {out_data[179]}]
set_fanout_load 10 [get_ports {out_data[178]}]
set_fanout_load 10 [get_ports {out_data[177]}]
set_fanout_load 10 [get_ports {out_data[176]}]
set_fanout_load 10 [get_ports {out_data[175]}]
set_fanout_load 10 [get_ports {out_data[174]}]
set_fanout_load 10 [get_ports {out_data[173]}]
set_fanout_load 10 [get_ports {out_data[172]}]
set_fanout_load 10 [get_ports {out_data[171]}]
set_fanout_load 10 [get_ports {out_data[170]}]
set_fanout_load 10 [get_ports {out_data[169]}]
set_fanout_load 10 [get_ports {out_data[168]}]
set_fanout_load 10 [get_ports {out_data[167]}]
set_fanout_load 10 [get_ports {out_data[166]}]
set_fanout_load 10 [get_ports {out_data[165]}]
set_fanout_load 10 [get_ports {out_data[164]}]
set_fanout_load 10 [get_ports {out_data[163]}]
set_fanout_load 10 [get_ports {out_data[162]}]
set_fanout_load 10 [get_ports {out_data[161]}]
set_fanout_load 10 [get_ports {out_data[160]}]
set_fanout_load 10 [get_ports {out_data[159]}]
set_fanout_load 10 [get_ports {out_data[158]}]
set_fanout_load 10 [get_ports {out_data[157]}]
set_fanout_load 10 [get_ports {out_data[156]}]
set_fanout_load 10 [get_ports {out_data[155]}]
set_fanout_load 10 [get_ports {out_data[154]}]
set_fanout_load 10 [get_ports {out_data[153]}]
set_fanout_load 10 [get_ports {out_data[152]}]
set_fanout_load 10 [get_ports {out_data[151]}]
set_fanout_load 10 [get_ports {out_data[150]}]
set_fanout_load 10 [get_ports {out_data[149]}]
set_fanout_load 10 [get_ports {out_data[148]}]
set_fanout_load 10 [get_ports {out_data[147]}]
set_fanout_load 10 [get_ports {out_data[146]}]
set_fanout_load 10 [get_ports {out_data[145]}]
set_fanout_load 10 [get_ports {out_data[144]}]
set_fanout_load 10 [get_ports {out_data[143]}]
set_fanout_load 10 [get_ports {out_data[142]}]
set_fanout_load 10 [get_ports {out_data[141]}]
set_fanout_load 10 [get_ports {out_data[140]}]
set_fanout_load 10 [get_ports {out_data[139]}]
set_fanout_load 10 [get_ports {out_data[138]}]
set_fanout_load 10 [get_ports {out_data[137]}]
set_fanout_load 10 [get_ports {out_data[136]}]
set_fanout_load 10 [get_ports {out_data[135]}]
set_fanout_load 10 [get_ports {out_data[134]}]
set_fanout_load 10 [get_ports {out_data[133]}]
set_fanout_load 10 [get_ports {out_data[132]}]
set_fanout_load 10 [get_ports {out_data[131]}]
set_fanout_load 10 [get_ports {out_data[130]}]
set_fanout_load 10 [get_ports {out_data[129]}]
set_fanout_load 10 [get_ports {out_data[128]}]
set_fanout_load 10 [get_ports {out_data[127]}]
set_fanout_load 10 [get_ports {out_data[126]}]
set_fanout_load 10 [get_ports {out_data[125]}]
set_fanout_load 10 [get_ports {out_data[124]}]
set_fanout_load 10 [get_ports {out_data[123]}]
set_fanout_load 10 [get_ports {out_data[122]}]
set_fanout_load 10 [get_ports {out_data[121]}]
set_fanout_load 10 [get_ports {out_data[120]}]
set_fanout_load 10 [get_ports {out_data[119]}]
set_fanout_load 10 [get_ports {out_data[118]}]
set_fanout_load 10 [get_ports {out_data[117]}]
set_fanout_load 10 [get_ports {out_data[116]}]
set_fanout_load 10 [get_ports {out_data[115]}]
set_fanout_load 10 [get_ports {out_data[114]}]
set_fanout_load 10 [get_ports {out_data[113]}]
set_fanout_load 10 [get_ports {out_data[112]}]
set_fanout_load 10 [get_ports {out_data[111]}]
set_fanout_load 10 [get_ports {out_data[110]}]
set_fanout_load 10 [get_ports {out_data[109]}]
set_fanout_load 10 [get_ports {out_data[108]}]
set_fanout_load 10 [get_ports {out_data[107]}]
set_fanout_load 10 [get_ports {out_data[106]}]
set_fanout_load 10 [get_ports {out_data[105]}]
set_fanout_load 10 [get_ports {out_data[104]}]
set_fanout_load 10 [get_ports {out_data[103]}]
set_fanout_load 10 [get_ports {out_data[102]}]
set_fanout_load 10 [get_ports {out_data[101]}]
set_fanout_load 10 [get_ports {out_data[100]}]
set_fanout_load 10 [get_ports {out_data[99]}]
set_fanout_load 10 [get_ports {out_data[98]}]
set_fanout_load 10 [get_ports {out_data[97]}]
set_fanout_load 10 [get_ports {out_data[96]}]
set_fanout_load 10 [get_ports {out_data[95]}]
set_fanout_load 10 [get_ports {out_data[94]}]
set_fanout_load 10 [get_ports {out_data[93]}]
set_fanout_load 10 [get_ports {out_data[92]}]
set_fanout_load 10 [get_ports {out_data[91]}]
set_fanout_load 10 [get_ports {out_data[90]}]
set_fanout_load 10 [get_ports {out_data[89]}]
set_fanout_load 10 [get_ports {out_data[88]}]
set_fanout_load 10 [get_ports {out_data[87]}]
set_fanout_load 10 [get_ports {out_data[86]}]
set_fanout_load 10 [get_ports {out_data[85]}]
set_fanout_load 10 [get_ports {out_data[84]}]
set_fanout_load 10 [get_ports {out_data[83]}]
set_fanout_load 10 [get_ports {out_data[82]}]
set_fanout_load 10 [get_ports {out_data[81]}]
set_fanout_load 10 [get_ports {out_data[80]}]
set_fanout_load 10 [get_ports {out_data[79]}]
set_fanout_load 10 [get_ports {out_data[78]}]
set_fanout_load 10 [get_ports {out_data[77]}]
set_fanout_load 10 [get_ports {out_data[76]}]
set_fanout_load 10 [get_ports {out_data[75]}]
set_fanout_load 10 [get_ports {out_data[74]}]
set_fanout_load 10 [get_ports {out_data[73]}]
set_fanout_load 10 [get_ports {out_data[72]}]
set_fanout_load 10 [get_ports {out_data[71]}]
set_fanout_load 10 [get_ports {out_data[70]}]
set_fanout_load 10 [get_ports {out_data[69]}]
set_fanout_load 10 [get_ports {out_data[68]}]
set_fanout_load 10 [get_ports {out_data[67]}]
set_fanout_load 10 [get_ports {out_data[66]}]
set_fanout_load 10 [get_ports {out_data[65]}]
set_fanout_load 10 [get_ports {out_data[64]}]
set_fanout_load 10 [get_ports {out_data[63]}]
set_fanout_load 10 [get_ports {out_data[62]}]
set_fanout_load 10 [get_ports {out_data[61]}]
set_fanout_load 10 [get_ports {out_data[60]}]
set_fanout_load 10 [get_ports {out_data[59]}]
set_fanout_load 10 [get_ports {out_data[58]}]
set_fanout_load 10 [get_ports {out_data[57]}]
set_fanout_load 10 [get_ports {out_data[56]}]
set_fanout_load 10 [get_ports {out_data[55]}]
set_fanout_load 10 [get_ports {out_data[54]}]
set_fanout_load 10 [get_ports {out_data[53]}]
set_fanout_load 10 [get_ports {out_data[52]}]
set_fanout_load 10 [get_ports {out_data[51]}]
set_fanout_load 10 [get_ports {out_data[50]}]
set_fanout_load 10 [get_ports {out_data[49]}]
set_fanout_load 10 [get_ports {out_data[48]}]
set_fanout_load 10 [get_ports {out_data[47]}]
set_fanout_load 10 [get_ports {out_data[46]}]
set_fanout_load 10 [get_ports {out_data[45]}]
set_fanout_load 10 [get_ports {out_data[44]}]
set_fanout_load 10 [get_ports {out_data[43]}]
set_fanout_load 10 [get_ports {out_data[42]}]
set_fanout_load 10 [get_ports {out_data[41]}]
set_fanout_load 10 [get_ports {out_data[40]}]
set_fanout_load 10 [get_ports {out_data[39]}]
set_fanout_load 10 [get_ports {out_data[38]}]
set_fanout_load 10 [get_ports {out_data[37]}]
set_fanout_load 10 [get_ports {out_data[36]}]
set_fanout_load 10 [get_ports {out_data[35]}]
set_fanout_load 10 [get_ports {out_data[34]}]
set_fanout_load 10 [get_ports {out_data[33]}]
set_fanout_load 10 [get_ports {out_data[32]}]
set_fanout_load 10 [get_ports {out_data[31]}]
set_fanout_load 10 [get_ports {out_data[30]}]
set_fanout_load 10 [get_ports {out_data[29]}]
set_fanout_load 10 [get_ports {out_data[28]}]
set_fanout_load 10 [get_ports {out_data[27]}]
set_fanout_load 10 [get_ports {out_data[26]}]
set_fanout_load 10 [get_ports {out_data[25]}]
set_fanout_load 10 [get_ports {out_data[24]}]
set_fanout_load 10 [get_ports {out_data[23]}]
set_fanout_load 10 [get_ports {out_data[22]}]
set_fanout_load 10 [get_ports {out_data[21]}]
set_fanout_load 10 [get_ports {out_data[20]}]
set_fanout_load 10 [get_ports {out_data[19]}]
set_fanout_load 10 [get_ports {out_data[18]}]
set_fanout_load 10 [get_ports {out_data[17]}]
set_fanout_load 10 [get_ports {out_data[16]}]
set_fanout_load 10 [get_ports {out_data[15]}]
set_fanout_load 10 [get_ports {out_data[14]}]
set_fanout_load 10 [get_ports {out_data[13]}]
set_fanout_load 10 [get_ports {out_data[12]}]
set_fanout_load 10 [get_ports {out_data[11]}]
set_fanout_load 10 [get_ports {out_data[10]}]
set_fanout_load 10 [get_ports {out_data[9]}]
set_fanout_load 10 [get_ports {out_data[8]}]
set_fanout_load 10 [get_ports {out_data[7]}]
set_fanout_load 10 [get_ports {out_data[6]}]
set_fanout_load 10 [get_ports {out_data[5]}]
set_fanout_load 10 [get_ports {out_data[4]}]
set_fanout_load 10 [get_ports {out_data[3]}]
set_fanout_load 10 [get_ports {out_data[2]}]
set_fanout_load 10 [get_ports {out_data[1]}]
set_fanout_load 10 [get_ports {out_data[0]}]
set_fanout_load 10 [get_ports out_vld]
set_fanout_load 10 [get_ports mismatch]
set_load -pin_load 0.1 [get_ports in_rdy]
set_load -pin_load 0.1 [get_ports {out_data[191]}]
set_load -pin_load 0.1 [get_ports {out_data[190]}]
set_load -pin_load 0.1 [get_ports {out_data[189]}]
set_load -pin_load 0.1 [get_ports {out_data[188]}]
set_load -pin_load 0.1 [get_ports {out_data[187]}]
set_load -pin_load 0.1 [get_ports {out_data[186]}]
set_load -pin_load 0.1 [get_ports {out_data[185]}]
set_load -pin_load 0.1 [get_ports {out_data[184]}]
set_load -pin_load 0.1 [get_ports {out_data[183]}]
set_load -pin_load 0.1 [get_ports {out_data[182]}]
set_load -pin_load 0.1 [get_ports {out_data[181]}]
set_load -pin_load 0.1 [get_ports {out_data[180]}]
set_load -pin_load 0.1 [get_ports {out_data[179]}]
set_load -pin_load 0.1 [get_ports {out_data[178]}]
set_load -pin_load 0.1 [get_ports {out_data[177]}]
set_load -pin_load 0.1 [get_ports {out_data[176]}]
set_load -pin_load 0.1 [get_ports {out_data[175]}]
set_load -pin_load 0.1 [get_ports {out_data[174]}]
set_load -pin_load 0.1 [get_ports {out_data[173]}]
set_load -pin_load 0.1 [get_ports {out_data[172]}]
set_load -pin_load 0.1 [get_ports {out_data[171]}]
set_load -pin_load 0.1 [get_ports {out_data[170]}]
set_load -pin_load 0.1 [get_ports {out_data[169]}]
set_load -pin_load 0.1 [get_ports {out_data[168]}]
set_load -pin_load 0.1 [get_ports {out_data[167]}]
set_load -pin_load 0.1 [get_ports {out_data[166]}]
set_load -pin_load 0.1 [get_ports {out_data[165]}]
set_load -pin_load 0.1 [get_ports {out_data[164]}]
set_load -pin_load 0.1 [get_ports {out_data[163]}]
set_load -pin_load 0.1 [get_ports {out_data[162]}]
set_load -pin_load 0.1 [get_ports {out_data[161]}]
set_load -pin_load 0.1 [get_ports {out_data[160]}]
set_load -pin_load 0.1 [get_ports {out_data[159]}]
set_load -pin_load 0.1 [get_ports {out_data[158]}]
set_load -pin_load 0.1 [get_ports {out_data[157]}]
set_load -pin_load 0.1 [get_ports {out_data[156]}]
set_load -pin_load 0.1 [get_ports {out_data[155]}]
set_load -pin_load 0.1 [get_ports {out_data[154]}]
set_load -pin_load 0.1 [get_ports {out_data[153]}]
set_load -pin_load 0.1 [get_ports {out_data[152]}]
set_load -pin_load 0.1 [get_ports {out_data[151]}]
set_load -pin_load 0.1 [get_ports {out_data[150]}]
set_load -pin_load 0.1 [get_ports {out_data[149]}]
set_load -pin_load 0.1 [get_ports {out_data[148]}]
set_load -pin_load 0.1 [get_ports {out_data[147]}]
set_load -pin_load 0.1 [get_ports {out_data[146]}]
set_load -pin_load 0.1 [get_ports {out_data[145]}]
set_load -pin_load 0.1 [get_ports {out_data[144]}]
set_load -pin_load 0.1 [get_ports {out_data[143]}]
set_load -pin_load 0.1 [get_ports {out_data[142]}]
set_load -pin_load 0.1 [get_ports {out_data[141]}]
set_load -pin_load 0.1 [get_ports {out_data[140]}]
set_load -pin_load 0.1 [get_ports {out_data[139]}]
set_load -pin_load 0.1 [get_ports {out_data[138]}]
set_load -pin_load 0.1 [get_ports {out_data[137]}]
set_load -pin_load 0.1 [get_ports {out_data[136]}]
set_load -pin_load 0.1 [get_ports {out_data[135]}]
set_load -pin_load 0.1 [get_ports {out_data[134]}]
set_load -pin_load 0.1 [get_ports {out_data[133]}]
set_load -pin_load 0.1 [get_ports {out_data[132]}]
set_load -pin_load 0.1 [get_ports {out_data[131]}]
set_load -pin_load 0.1 [get_ports {out_data[130]}]
set_load -pin_load 0.1 [get_ports {out_data[129]}]
set_load -pin_load 0.1 [get_ports {out_data[128]}]
set_load -pin_load 0.1 [get_ports {out_data[127]}]
set_load -pin_load 0.1 [get_ports {out_data[126]}]
set_load -pin_load 0.1 [get_ports {out_data[125]}]
set_load -pin_load 0.1 [get_ports {out_data[124]}]
set_load -pin_load 0.1 [get_ports {out_data[123]}]
set_load -pin_load 0.1 [get_ports {out_data[122]}]
set_load -pin_load 0.1 [get_ports {out_data[121]}]
set_load -pin_load 0.1 [get_ports {out_data[120]}]
set_load -pin_load 0.1 [get_ports {out_data[119]}]
set_load -pin_load 0.1 [get_ports {out_data[118]}]
set_load -pin_load 0.1 [get_ports {out_data[117]}]
set_load -pin_load 0.1 [get_ports {out_data[116]}]
set_load -pin_load 0.1 [get_ports {out_data[115]}]
set_load -pin_load 0.1 [get_ports {out_data[114]}]
set_load -pin_load 0.1 [get_ports {out_data[113]}]
set_load -pin_load 0.1 [get_ports {out_data[112]}]
set_load -pin_load 0.1 [get_ports {out_data[111]}]
set_load -pin_load 0.1 [get_ports {out_data[110]}]
set_load -pin_load 0.1 [get_ports {out_data[109]}]
set_load -pin_load 0.1 [get_ports {out_data[108]}]
set_load -pin_load 0.1 [get_ports {out_data[107]}]
set_load -pin_load 0.1 [get_ports {out_data[106]}]
set_load -pin_load 0.1 [get_ports {out_data[105]}]
set_load -pin_load 0.1 [get_ports {out_data[104]}]
set_load -pin_load 0.1 [get_ports {out_data[103]}]
set_load -pin_load 0.1 [get_ports {out_data[102]}]
set_load -pin_load 0.1 [get_ports {out_data[101]}]
set_load -pin_load 0.1 [get_ports {out_data[100]}]
set_load -pin_load 0.1 [get_ports {out_data[99]}]
set_load -pin_load 0.1 [get_ports {out_data[98]}]
set_load -pin_load 0.1 [get_ports {out_data[97]}]
set_load -pin_load 0.1 [get_ports {out_data[96]}]
set_load -pin_load 0.1 [get_ports {out_data[95]}]
set_load -pin_load 0.1 [get_ports {out_data[94]}]
set_load -pin_load 0.1 [get_ports {out_data[93]}]
set_load -pin_load 0.1 [get_ports {out_data[92]}]
set_load -pin_load 0.1 [get_ports {out_data[91]}]
set_load -pin_load 0.1 [get_ports {out_data[90]}]
set_load -pin_load 0.1 [get_ports {out_data[89]}]
set_load -pin_load 0.1 [get_ports {out_data[88]}]
set_load -pin_load 0.1 [get_ports {out_data[87]}]
set_load -pin_load 0.1 [get_ports {out_data[86]}]
set_load -pin_load 0.1 [get_ports {out_data[85]}]
set_load -pin_load 0.1 [get_ports {out_data[84]}]
set_load -pin_load 0.1 [get_ports {out_data[83]}]
set_load -pin_load 0.1 [get_ports {out_data[82]}]
set_load -pin_load 0.1 [get_ports {out_data[81]}]
set_load -pin_load 0.1 [get_ports {out_data[80]}]
set_load -pin_load 0.1 [get_ports {out_data[79]}]
set_load -pin_load 0.1 [get_ports {out_data[78]}]
set_load -pin_load 0.1 [get_ports {out_data[77]}]
set_load -pin_load 0.1 [get_ports {out_data[76]}]
set_load -pin_load 0.1 [get_ports {out_data[75]}]
set_load -pin_load 0.1 [get_ports {out_data[74]}]
set_load -pin_load 0.1 [get_ports {out_data[73]}]
set_load -pin_load 0.1 [get_ports {out_data[72]}]
set_load -pin_load 0.1 [get_ports {out_data[71]}]
set_load -pin_load 0.1 [get_ports {out_data[70]}]
set_load -pin_load 0.1 [get_ports {out_data[69]}]
set_load -pin_load 0.1 [get_ports {out_data[68]}]
set_load -pin_load 0.1 [get_ports {out_data[67]}]
set_load -pin_load 0.1 [get_ports {out_data[66]}]
set_load -pin_load 0.1 [get_ports {out_data[65]}]
set_load -pin_load 0.1 [get_ports {out_data[64]}]
set_load -pin_load 0.1 [get_ports {out_data[63]}]
set_load -pin_load 0.1 [get_ports {out_data[62]}]
set_load -pin_load 0.1 [get_ports {out_data[61]}]
set_load -pin_load 0.1 [get_ports {out_data[60]}]
set_load -pin_load 0.1 [get_ports {out_data[59]}]
set_load -pin_load 0.1 [get_ports {out_data[58]}]
set_load -pin_load 0.1 [get_ports {out_data[57]}]
set_load -pin_load 0.1 [get_ports {out_data[56]}]
set_load -pin_load 0.1 [get_ports {out_data[55]}]
set_load -pin_load 0.1 [get_ports {out_data[54]}]
set_load -pin_load 0.1 [get_ports {out_data[53]}]
set_load -pin_load 0.1 [get_ports {out_data[52]}]
set_load -pin_load 0.1 [get_ports {out_data[51]}]
set_load -pin_load 0.1 [get_ports {out_data[50]}]
set_load -pin_load 0.1 [get_ports {out_data[49]}]
set_load -pin_load 0.1 [get_ports {out_data[48]}]
set_load -pin_load 0.1 [get_ports {out_data[47]}]
set_load -pin_load 0.1 [get_ports {out_data[46]}]
set_load -pin_load 0.1 [get_ports {out_data[45]}]
set_load -pin_load 0.1 [get_ports {out_data[44]}]
set_load -pin_load 0.1 [get_ports {out_data[43]}]
set_load -pin_load 0.1 [get_ports {out_data[42]}]
set_load -pin_load 0.1 [get_ports {out_data[41]}]
set_load -pin_load 0.1 [get_ports {out_data[40]}]
set_load -pin_load 0.1 [get_ports {out_data[39]}]
set_load -pin_load 0.1 [get_ports {out_data[38]}]
set_load -pin_load 0.1 [get_ports {out_data[37]}]
set_load -pin_load 0.1 [get_ports {out_data[36]}]
set_load -pin_load 0.1 [get_ports {out_data[35]}]
set_load -pin_load 0.1 [get_ports {out_data[34]}]
set_load -pin_load 0.1 [get_ports {out_data[33]}]
set_load -pin_load 0.1 [get_ports {out_data[32]}]
set_load -pin_load 0.1 [get_ports {out_data[31]}]
set_load -pin_load 0.1 [get_ports {out_data[30]}]
set_load -pin_load 0.1 [get_ports {out_data[29]}]
set_load -pin_load 0.1 [get_ports {out_data[28]}]
set_load -pin_load 0.1 [get_ports {out_data[27]}]
set_load -pin_load 0.1 [get_ports {out_data[26]}]
set_load -pin_load 0.1 [get_ports {out_data[25]}]
set_load -pin_load 0.1 [get_ports {out_data[24]}]
set_load -pin_load 0.1 [get_ports {out_data[23]}]
set_load -pin_load 0.1 [get_ports {out_data[22]}]
set_load -pin_load 0.1 [get_ports {out_data[21]}]
set_load -pin_load 0.1 [get_ports {out_data[20]}]
set_load -pin_load 0.1 [get_ports {out_data[19]}]
set_load -pin_load 0.1 [get_ports {out_data[18]}]
set_load -pin_load 0.1 [get_ports {out_data[17]}]
set_load -pin_load 0.1 [get_ports {out_data[16]}]
set_load -pin_load 0.1 [get_ports {out_data[15]}]
set_load -pin_load 0.1 [get_ports {out_data[14]}]
set_load -pin_load 0.1 [get_ports {out_data[13]}]
set_load -pin_load 0.1 [get_ports {out_data[12]}]
set_load -pin_load 0.1 [get_ports {out_data[11]}]
set_load -pin_load 0.1 [get_ports {out_data[10]}]
set_load -pin_load 0.1 [get_ports {out_data[9]}]
set_load -pin_load 0.1 [get_ports {out_data[8]}]
set_load -pin_load 0.1 [get_ports {out_data[7]}]
set_load -pin_load 0.1 [get_ports {out_data[6]}]
set_load -pin_load 0.1 [get_ports {out_data[5]}]
set_load -pin_load 0.1 [get_ports {out_data[4]}]
set_load -pin_load 0.1 [get_ports {out_data[3]}]
set_load -pin_load 0.1 [get_ports {out_data[2]}]
set_load -pin_load 0.1 [get_ports {out_data[1]}]
set_load -pin_load 0.1 [get_ports {out_data[0]}]
set_load -pin_load 0.1 [get_ports out_vld]
set_load -pin_load 0.1 [get_ports mismatch]
create_clock [get_ports clk]  -period 3.87  -waveform {0 1.935}
set_clock_uncertainty 0.1  [get_clocks clk]
create_generated_clock [get_ports clk_shadow]  -name clk_shadow  -source [get_ports clk]  -edges {1 2 3}  -edge_shift {1.7 1.7 1.7}
set_clock_uncertainty 0.1  [get_clocks clk_shadow]
group_path -name input_grp  -from [list [get_ports clk] [get_ports clk_shadow] [get_ports rst_n]          \
[get_ports {in_data[191]}] [get_ports {in_data[190]}] [get_ports               \
{in_data[189]}] [get_ports {in_data[188]}] [get_ports {in_data[187]}]          \
[get_ports {in_data[186]}] [get_ports {in_data[185]}] [get_ports               \
{in_data[184]}] [get_ports {in_data[183]}] [get_ports {in_data[182]}]          \
[get_ports {in_data[181]}] [get_ports {in_data[180]}] [get_ports               \
{in_data[179]}] [get_ports {in_data[178]}] [get_ports {in_data[177]}]          \
[get_ports {in_data[176]}] [get_ports {in_data[175]}] [get_ports               \
{in_data[174]}] [get_ports {in_data[173]}] [get_ports {in_data[172]}]          \
[get_ports {in_data[171]}] [get_ports {in_data[170]}] [get_ports               \
{in_data[169]}] [get_ports {in_data[168]}] [get_ports {in_data[167]}]          \
[get_ports {in_data[166]}] [get_ports {in_data[165]}] [get_ports               \
{in_data[164]}] [get_ports {in_data[163]}] [get_ports {in_data[162]}]          \
[get_ports {in_data[161]}] [get_ports {in_data[160]}] [get_ports               \
{in_data[159]}] [get_ports {in_data[158]}] [get_ports {in_data[157]}]          \
[get_ports {in_data[156]}] [get_ports {in_data[155]}] [get_ports               \
{in_data[154]}] [get_ports {in_data[153]}] [get_ports {in_data[152]}]          \
[get_ports {in_data[151]}] [get_ports {in_data[150]}] [get_ports               \
{in_data[149]}] [get_ports {in_data[148]}] [get_ports {in_data[147]}]          \
[get_ports {in_data[146]}] [get_ports {in_data[145]}] [get_ports               \
{in_data[144]}] [get_ports {in_data[143]}] [get_ports {in_data[142]}]          \
[get_ports {in_data[141]}] [get_ports {in_data[140]}] [get_ports               \
{in_data[139]}] [get_ports {in_data[138]}] [get_ports {in_data[137]}]          \
[get_ports {in_data[136]}] [get_ports {in_data[135]}] [get_ports               \
{in_data[134]}] [get_ports {in_data[133]}] [get_ports {in_data[132]}]          \
[get_ports {in_data[131]}] [get_ports {in_data[130]}] [get_ports               \
{in_data[129]}] [get_ports {in_data[128]}] [get_ports {in_data[127]}]          \
[get_ports {in_data[126]}] [get_ports {in_data[125]}] [get_ports               \
{in_data[124]}] [get_ports {in_data[123]}] [get_ports {in_data[122]}]          \
[get_ports {in_data[121]}] [get_ports {in_data[120]}] [get_ports               \
{in_data[119]}] [get_ports {in_data[118]}] [get_ports {in_data[117]}]          \
[get_ports {in_data[116]}] [get_ports {in_data[115]}] [get_ports               \
{in_data[114]}] [get_ports {in_data[113]}] [get_ports {in_data[112]}]          \
[get_ports {in_data[111]}] [get_ports {in_data[110]}] [get_ports               \
{in_data[109]}] [get_ports {in_data[108]}] [get_ports {in_data[107]}]          \
[get_ports {in_data[106]}] [get_ports {in_data[105]}] [get_ports               \
{in_data[104]}] [get_ports {in_data[103]}] [get_ports {in_data[102]}]          \
[get_ports {in_data[101]}] [get_ports {in_data[100]}] [get_ports               \
{in_data[99]}] [get_ports {in_data[98]}] [get_ports {in_data[97]}] [get_ports  \
{in_data[96]}] [get_ports {in_data[95]}] [get_ports {in_data[94]}] [get_ports  \
{in_data[93]}] [get_ports {in_data[92]}] [get_ports {in_data[91]}] [get_ports  \
{in_data[90]}] [get_ports {in_data[89]}] [get_ports {in_data[88]}] [get_ports  \
{in_data[87]}] [get_ports {in_data[86]}] [get_ports {in_data[85]}] [get_ports  \
{in_data[84]}] [get_ports {in_data[83]}] [get_ports {in_data[82]}] [get_ports  \
{in_data[81]}] [get_ports {in_data[80]}] [get_ports {in_data[79]}] [get_ports  \
{in_data[78]}] [get_ports {in_data[77]}] [get_ports {in_data[76]}] [get_ports  \
{in_data[75]}] [get_ports {in_data[74]}] [get_ports {in_data[73]}] [get_ports  \
{in_data[72]}] [get_ports {in_data[71]}] [get_ports {in_data[70]}] [get_ports  \
{in_data[69]}] [get_ports {in_data[68]}] [get_ports {in_data[67]}] [get_ports  \
{in_data[66]}] [get_ports {in_data[65]}] [get_ports {in_data[64]}] [get_ports  \
{in_data[63]}] [get_ports {in_data[62]}] [get_ports {in_data[61]}] [get_ports  \
{in_data[60]}] [get_ports {in_data[59]}] [get_ports {in_data[58]}] [get_ports  \
{in_data[57]}] [get_ports {in_data[56]}] [get_ports {in_data[55]}] [get_ports  \
{in_data[54]}] [get_ports {in_data[53]}] [get_ports {in_data[52]}] [get_ports  \
{in_data[51]}] [get_ports {in_data[50]}] [get_ports {in_data[49]}] [get_ports  \
{in_data[48]}] [get_ports {in_data[47]}] [get_ports {in_data[46]}] [get_ports  \
{in_data[45]}] [get_ports {in_data[44]}] [get_ports {in_data[43]}] [get_ports  \
{in_data[42]}] [get_ports {in_data[41]}] [get_ports {in_data[40]}] [get_ports  \
{in_data[39]}] [get_ports {in_data[38]}] [get_ports {in_data[37]}] [get_ports  \
{in_data[36]}] [get_ports {in_data[35]}] [get_ports {in_data[34]}] [get_ports  \
{in_data[33]}] [get_ports {in_data[32]}] [get_ports {in_data[31]}] [get_ports  \
{in_data[30]}] [get_ports {in_data[29]}] [get_ports {in_data[28]}] [get_ports  \
{in_data[27]}] [get_ports {in_data[26]}] [get_ports {in_data[25]}] [get_ports  \
{in_data[24]}] [get_ports {in_data[23]}] [get_ports {in_data[22]}] [get_ports  \
{in_data[21]}] [get_ports {in_data[20]}] [get_ports {in_data[19]}] [get_ports  \
{in_data[18]}] [get_ports {in_data[17]}] [get_ports {in_data[16]}] [get_ports  \
{in_data[15]}] [get_ports {in_data[14]}] [get_ports {in_data[13]}] [get_ports  \
{in_data[12]}] [get_ports {in_data[11]}] [get_ports {in_data[10]}] [get_ports  \
{in_data[9]}] [get_ports {in_data[8]}] [get_ports {in_data[7]}] [get_ports     \
{in_data[6]}] [get_ports {in_data[5]}] [get_ports {in_data[4]}] [get_ports     \
{in_data[3]}] [get_ports {in_data[2]}] [get_ports {in_data[1]}] [get_ports     \
{in_data[0]}] [get_ports in_vld] [get_ports out_rdy]]
group_path -name output_grp  -to [list [get_ports in_rdy] [get_ports {out_data[191]}] [get_ports           \
{out_data[190]}] [get_ports {out_data[189]}] [get_ports {out_data[188]}]       \
[get_ports {out_data[187]}] [get_ports {out_data[186]}] [get_ports             \
{out_data[185]}] [get_ports {out_data[184]}] [get_ports {out_data[183]}]       \
[get_ports {out_data[182]}] [get_ports {out_data[181]}] [get_ports             \
{out_data[180]}] [get_ports {out_data[179]}] [get_ports {out_data[178]}]       \
[get_ports {out_data[177]}] [get_ports {out_data[176]}] [get_ports             \
{out_data[175]}] [get_ports {out_data[174]}] [get_ports {out_data[173]}]       \
[get_ports {out_data[172]}] [get_ports {out_data[171]}] [get_ports             \
{out_data[170]}] [get_ports {out_data[169]}] [get_ports {out_data[168]}]       \
[get_ports {out_data[167]}] [get_ports {out_data[166]}] [get_ports             \
{out_data[165]}] [get_ports {out_data[164]}] [get_ports {out_data[163]}]       \
[get_ports {out_data[162]}] [get_ports {out_data[161]}] [get_ports             \
{out_data[160]}] [get_ports {out_data[159]}] [get_ports {out_data[158]}]       \
[get_ports {out_data[157]}] [get_ports {out_data[156]}] [get_ports             \
{out_data[155]}] [get_ports {out_data[154]}] [get_ports {out_data[153]}]       \
[get_ports {out_data[152]}] [get_ports {out_data[151]}] [get_ports             \
{out_data[150]}] [get_ports {out_data[149]}] [get_ports {out_data[148]}]       \
[get_ports {out_data[147]}] [get_ports {out_data[146]}] [get_ports             \
{out_data[145]}] [get_ports {out_data[144]}] [get_ports {out_data[143]}]       \
[get_ports {out_data[142]}] [get_ports {out_data[141]}] [get_ports             \
{out_data[140]}] [get_ports {out_data[139]}] [get_ports {out_data[138]}]       \
[get_ports {out_data[137]}] [get_ports {out_data[136]}] [get_ports             \
{out_data[135]}] [get_ports {out_data[134]}] [get_ports {out_data[133]}]       \
[get_ports {out_data[132]}] [get_ports {out_data[131]}] [get_ports             \
{out_data[130]}] [get_ports {out_data[129]}] [get_ports {out_data[128]}]       \
[get_ports {out_data[127]}] [get_ports {out_data[126]}] [get_ports             \
{out_data[125]}] [get_ports {out_data[124]}] [get_ports {out_data[123]}]       \
[get_ports {out_data[122]}] [get_ports {out_data[121]}] [get_ports             \
{out_data[120]}] [get_ports {out_data[119]}] [get_ports {out_data[118]}]       \
[get_ports {out_data[117]}] [get_ports {out_data[116]}] [get_ports             \
{out_data[115]}] [get_ports {out_data[114]}] [get_ports {out_data[113]}]       \
[get_ports {out_data[112]}] [get_ports {out_data[111]}] [get_ports             \
{out_data[110]}] [get_ports {out_data[109]}] [get_ports {out_data[108]}]       \
[get_ports {out_data[107]}] [get_ports {out_data[106]}] [get_ports             \
{out_data[105]}] [get_ports {out_data[104]}] [get_ports {out_data[103]}]       \
[get_ports {out_data[102]}] [get_ports {out_data[101]}] [get_ports             \
{out_data[100]}] [get_ports {out_data[99]}] [get_ports {out_data[98]}]         \
[get_ports {out_data[97]}] [get_ports {out_data[96]}] [get_ports               \
{out_data[95]}] [get_ports {out_data[94]}] [get_ports {out_data[93]}]          \
[get_ports {out_data[92]}] [get_ports {out_data[91]}] [get_ports               \
{out_data[90]}] [get_ports {out_data[89]}] [get_ports {out_data[88]}]          \
[get_ports {out_data[87]}] [get_ports {out_data[86]}] [get_ports               \
{out_data[85]}] [get_ports {out_data[84]}] [get_ports {out_data[83]}]          \
[get_ports {out_data[82]}] [get_ports {out_data[81]}] [get_ports               \
{out_data[80]}] [get_ports {out_data[79]}] [get_ports {out_data[78]}]          \
[get_ports {out_data[77]}] [get_ports {out_data[76]}] [get_ports               \
{out_data[75]}] [get_ports {out_data[74]}] [get_ports {out_data[73]}]          \
[get_ports {out_data[72]}] [get_ports {out_data[71]}] [get_ports               \
{out_data[70]}] [get_ports {out_data[69]}] [get_ports {out_data[68]}]          \
[get_ports {out_data[67]}] [get_ports {out_data[66]}] [get_ports               \
{out_data[65]}] [get_ports {out_data[64]}] [get_ports {out_data[63]}]          \
[get_ports {out_data[62]}] [get_ports {out_data[61]}] [get_ports               \
{out_data[60]}] [get_ports {out_data[59]}] [get_ports {out_data[58]}]          \
[get_ports {out_data[57]}] [get_ports {out_data[56]}] [get_ports               \
{out_data[55]}] [get_ports {out_data[54]}] [get_ports {out_data[53]}]          \
[get_ports {out_data[52]}] [get_ports {out_data[51]}] [get_ports               \
{out_data[50]}] [get_ports {out_data[49]}] [get_ports {out_data[48]}]          \
[get_ports {out_data[47]}] [get_ports {out_data[46]}] [get_ports               \
{out_data[45]}] [get_ports {out_data[44]}] [get_ports {out_data[43]}]          \
[get_ports {out_data[42]}] [get_ports {out_data[41]}] [get_ports               \
{out_data[40]}] [get_ports {out_data[39]}] [get_ports {out_data[38]}]          \
[get_ports {out_data[37]}] [get_ports {out_data[36]}] [get_ports               \
{out_data[35]}] [get_ports {out_data[34]}] [get_ports {out_data[33]}]          \
[get_ports {out_data[32]}] [get_ports {out_data[31]}] [get_ports               \
{out_data[30]}] [get_ports {out_data[29]}] [get_ports {out_data[28]}]          \
[get_ports {out_data[27]}] [get_ports {out_data[26]}] [get_ports               \
{out_data[25]}] [get_ports {out_data[24]}] [get_ports {out_data[23]}]          \
[get_ports {out_data[22]}] [get_ports {out_data[21]}] [get_ports               \
{out_data[20]}] [get_ports {out_data[19]}] [get_ports {out_data[18]}]          \
[get_ports {out_data[17]}] [get_ports {out_data[16]}] [get_ports               \
{out_data[15]}] [get_ports {out_data[14]}] [get_ports {out_data[13]}]          \
[get_ports {out_data[12]}] [get_ports {out_data[11]}] [get_ports               \
{out_data[10]}] [get_ports {out_data[9]}] [get_ports {out_data[8]}] [get_ports \
{out_data[7]}] [get_ports {out_data[6]}] [get_ports {out_data[5]}] [get_ports  \
{out_data[4]}] [get_ports {out_data[3]}] [get_ports {out_data[2]}] [get_ports  \
{out_data[1]}] [get_ports {out_data[0]}] [get_ports out_vld] [get_ports        \
mismatch]]
set_input_delay -clock clk  0.1  [get_ports rst_n]
set_input_delay -clock clk  0.1  [get_ports {in_data[191]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[190]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[189]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[188]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[187]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[186]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[185]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[184]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[183]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[182]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[181]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[180]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[179]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[178]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[177]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[176]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[175]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[174]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[173]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[172]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[171]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[170]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[169]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[168]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[167]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[166]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[165]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[164]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[163]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[162]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[161]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[160]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[159]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[158]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[157]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[156]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[155]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[154]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[153]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[152]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[151]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[150]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[149]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[148]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[147]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[146]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[145]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[144]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[143]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[142]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[141]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[140]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[139]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[138]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[137]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[136]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[135]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[134]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[133]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[132]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[131]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[130]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[129]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[128]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[127]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[126]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[125]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[124]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[123]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[122]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[121]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[120]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[119]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[118]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[117]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[116]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[115]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[114]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[113]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[112]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[111]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[110]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[109]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[108]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[107]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[106]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[105]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[104]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[103]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[102]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[101]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[100]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[99]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[98]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[97]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[96]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[95]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[94]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[93]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[92]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[91]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[90]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[89]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[88]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[87]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[86]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[85]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[84]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[83]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[82]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[81]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[80]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[79]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[78]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[77]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[76]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[75]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[74]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[73]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[72]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[71]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[70]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[69]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[68]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[67]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[66]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[65]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[64]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[63]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[62]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[61]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[60]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[59]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[58]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[57]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[56]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[55]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[54]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[53]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[52]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[51]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[50]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[49]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[48]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[47]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[46]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[45]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[44]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[43]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[42]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[41]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[40]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[39]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[38]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[37]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[36]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[35]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[34]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[33]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[32]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[31]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[30]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[29]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[28]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[27]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[26]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[25]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[24]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[23]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[22]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[21]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[20]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[19]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[18]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[17]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[16]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[15]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[14]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[13]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[12]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[11]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[10]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[9]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[8]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[7]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[6]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[5]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[4]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[3]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[2]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[1]}]
set_input_delay -clock clk  0.1  [get_ports {in_data[0]}]
set_input_delay -clock clk  0.1  [get_ports in_vld]
set_input_delay -clock clk  0.1  [get_ports out_rdy]
set_output_delay -clock clk  0.1  [get_ports in_rdy]
set_output_delay -clock clk  0.1  [get_ports {out_data[191]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[190]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[189]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[188]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[187]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[186]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[185]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[184]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[183]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[182]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[181]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[180]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[179]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[178]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[177]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[176]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[175]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[174]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[173]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[172]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[171]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[170]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[169]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[168]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[167]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[166]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[165]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[164]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[163]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[162]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[161]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[160]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[159]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[158]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[157]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[156]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[155]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[154]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[153]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[152]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[151]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[150]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[149]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[148]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[147]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[146]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[145]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[144]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[143]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[142]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[141]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[140]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[139]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[138]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[137]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[136]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[135]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[134]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[133]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[132]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[131]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[130]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[129]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[128]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[127]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[126]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[125]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[124]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[123]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[122]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[121]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[120]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[119]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[118]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[117]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[116]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[115]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[114]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[113]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[112]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[111]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[110]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[109]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[108]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[107]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[106]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[105]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[104]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[103]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[102]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[101]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[100]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[99]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[98]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[97]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[96]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[95]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[94]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[93]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[92]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[91]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[90]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[89]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[88]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[87]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[86]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[85]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[84]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[83]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[82]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[81]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[80]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[79]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[78]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[77]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[76]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[75]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[74]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[73]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[72]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[71]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[70]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[69]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[68]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[67]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[66]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[65]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[64]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[63]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[62]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[61]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[60]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[59]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[58]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[57]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[56]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[55]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[54]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[53]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[52]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[51]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[50]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[49]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[48]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[47]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[46]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[45]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[44]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[43]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[42]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[41]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[40]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[39]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[38]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[37]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[36]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[35]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[34]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[33]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[32]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[31]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[30]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[29]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[28]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[27]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[26]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[25]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[24]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[23]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[22]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[21]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[20]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[19]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[18]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[17]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[16]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[15]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[14]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[13]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[12]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[11]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[10]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[9]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[8]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[7]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[6]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[5]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[4]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[3]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[2]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[1]}]
set_output_delay -clock clk  0.1  [get_ports {out_data[0]}]
set_output_delay -clock clk  0.1  [get_ports out_vld]
set_output_delay -clock clk  0.1  [get_ports mismatch]
set_max_delay 3.87  -to [get_ports in_rdy]
set_max_delay 3.87  -to [get_ports {out_data[191]}]
set_max_delay 3.87  -to [get_ports {out_data[190]}]
set_max_delay 3.87  -to [get_ports {out_data[189]}]
set_max_delay 3.87  -to [get_ports {out_data[188]}]
set_max_delay 3.87  -to [get_ports {out_data[187]}]
set_max_delay 3.87  -to [get_ports {out_data[186]}]
set_max_delay 3.87  -to [get_ports {out_data[185]}]
set_max_delay 3.87  -to [get_ports {out_data[184]}]
set_max_delay 3.87  -to [get_ports {out_data[183]}]
set_max_delay 3.87  -to [get_ports {out_data[182]}]
set_max_delay 3.87  -to [get_ports {out_data[181]}]
set_max_delay 3.87  -to [get_ports {out_data[180]}]
set_max_delay 3.87  -to [get_ports {out_data[179]}]
set_max_delay 3.87  -to [get_ports {out_data[178]}]
set_max_delay 3.87  -to [get_ports {out_data[177]}]
set_max_delay 3.87  -to [get_ports {out_data[176]}]
set_max_delay 3.87  -to [get_ports {out_data[175]}]
set_max_delay 3.87  -to [get_ports {out_data[174]}]
set_max_delay 3.87  -to [get_ports {out_data[173]}]
set_max_delay 3.87  -to [get_ports {out_data[172]}]
set_max_delay 3.87  -to [get_ports {out_data[171]}]
set_max_delay 3.87  -to [get_ports {out_data[170]}]
set_max_delay 3.87  -to [get_ports {out_data[169]}]
set_max_delay 3.87  -to [get_ports {out_data[168]}]
set_max_delay 3.87  -to [get_ports {out_data[167]}]
set_max_delay 3.87  -to [get_ports {out_data[166]}]
set_max_delay 3.87  -to [get_ports {out_data[165]}]
set_max_delay 3.87  -to [get_ports {out_data[164]}]
set_max_delay 3.87  -to [get_ports {out_data[163]}]
set_max_delay 3.87  -to [get_ports {out_data[162]}]
set_max_delay 3.87  -to [get_ports {out_data[161]}]
set_max_delay 3.87  -to [get_ports {out_data[160]}]
set_max_delay 3.87  -to [get_ports {out_data[159]}]
set_max_delay 3.87  -to [get_ports {out_data[158]}]
set_max_delay 3.87  -to [get_ports {out_data[157]}]
set_max_delay 3.87  -to [get_ports {out_data[156]}]
set_max_delay 3.87  -to [get_ports {out_data[155]}]
set_max_delay 3.87  -to [get_ports {out_data[154]}]
set_max_delay 3.87  -to [get_ports {out_data[153]}]
set_max_delay 3.87  -to [get_ports {out_data[152]}]
set_max_delay 3.87  -to [get_ports {out_data[151]}]
set_max_delay 3.87  -to [get_ports {out_data[150]}]
set_max_delay 3.87  -to [get_ports {out_data[149]}]
set_max_delay 3.87  -to [get_ports {out_data[148]}]
set_max_delay 3.87  -to [get_ports {out_data[147]}]
set_max_delay 3.87  -to [get_ports {out_data[146]}]
set_max_delay 3.87  -to [get_ports {out_data[145]}]
set_max_delay 3.87  -to [get_ports {out_data[144]}]
set_max_delay 3.87  -to [get_ports {out_data[143]}]
set_max_delay 3.87  -to [get_ports {out_data[142]}]
set_max_delay 3.87  -to [get_ports {out_data[141]}]
set_max_delay 3.87  -to [get_ports {out_data[140]}]
set_max_delay 3.87  -to [get_ports {out_data[139]}]
set_max_delay 3.87  -to [get_ports {out_data[138]}]
set_max_delay 3.87  -to [get_ports {out_data[137]}]
set_max_delay 3.87  -to [get_ports {out_data[136]}]
set_max_delay 3.87  -to [get_ports {out_data[135]}]
set_max_delay 3.87  -to [get_ports {out_data[134]}]
set_max_delay 3.87  -to [get_ports {out_data[133]}]
set_max_delay 3.87  -to [get_ports {out_data[132]}]
set_max_delay 3.87  -to [get_ports {out_data[131]}]
set_max_delay 3.87  -to [get_ports {out_data[130]}]
set_max_delay 3.87  -to [get_ports {out_data[129]}]
set_max_delay 3.87  -to [get_ports {out_data[128]}]
set_max_delay 3.87  -to [get_ports {out_data[127]}]
set_max_delay 3.87  -to [get_ports {out_data[126]}]
set_max_delay 3.87  -to [get_ports {out_data[125]}]
set_max_delay 3.87  -to [get_ports {out_data[124]}]
set_max_delay 3.87  -to [get_ports {out_data[123]}]
set_max_delay 3.87  -to [get_ports {out_data[122]}]
set_max_delay 3.87  -to [get_ports {out_data[121]}]
set_max_delay 3.87  -to [get_ports {out_data[120]}]
set_max_delay 3.87  -to [get_ports {out_data[119]}]
set_max_delay 3.87  -to [get_ports {out_data[118]}]
set_max_delay 3.87  -to [get_ports {out_data[117]}]
set_max_delay 3.87  -to [get_ports {out_data[116]}]
set_max_delay 3.87  -to [get_ports {out_data[115]}]
set_max_delay 3.87  -to [get_ports {out_data[114]}]
set_max_delay 3.87  -to [get_ports {out_data[113]}]
set_max_delay 3.87  -to [get_ports {out_data[112]}]
set_max_delay 3.87  -to [get_ports {out_data[111]}]
set_max_delay 3.87  -to [get_ports {out_data[110]}]
set_max_delay 3.87  -to [get_ports {out_data[109]}]
set_max_delay 3.87  -to [get_ports {out_data[108]}]
set_max_delay 3.87  -to [get_ports {out_data[107]}]
set_max_delay 3.87  -to [get_ports {out_data[106]}]
set_max_delay 3.87  -to [get_ports {out_data[105]}]
set_max_delay 3.87  -to [get_ports {out_data[104]}]
set_max_delay 3.87  -to [get_ports {out_data[103]}]
set_max_delay 3.87  -to [get_ports {out_data[102]}]
set_max_delay 3.87  -to [get_ports {out_data[101]}]
set_max_delay 3.87  -to [get_ports {out_data[100]}]
set_max_delay 3.87  -to [get_ports {out_data[99]}]
set_max_delay 3.87  -to [get_ports {out_data[98]}]
set_max_delay 3.87  -to [get_ports {out_data[97]}]
set_max_delay 3.87  -to [get_ports {out_data[96]}]
set_max_delay 3.87  -to [get_ports {out_data[95]}]
set_max_delay 3.87  -to [get_ports {out_data[94]}]
set_max_delay 3.87  -to [get_ports {out_data[93]}]
set_max_delay 3.87  -to [get_ports {out_data[92]}]
set_max_delay 3.87  -to [get_ports {out_data[91]}]
set_max_delay 3.87  -to [get_ports {out_data[90]}]
set_max_delay 3.87  -to [get_ports {out_data[89]}]
set_max_delay 3.87  -to [get_ports {out_data[88]}]
set_max_delay 3.87  -to [get_ports {out_data[87]}]
set_max_delay 3.87  -to [get_ports {out_data[86]}]
set_max_delay 3.87  -to [get_ports {out_data[85]}]
set_max_delay 3.87  -to [get_ports {out_data[84]}]
set_max_delay 3.87  -to [get_ports {out_data[83]}]
set_max_delay 3.87  -to [get_ports {out_data[82]}]
set_max_delay 3.87  -to [get_ports {out_data[81]}]
set_max_delay 3.87  -to [get_ports {out_data[80]}]
set_max_delay 3.87  -to [get_ports {out_data[79]}]
set_max_delay 3.87  -to [get_ports {out_data[78]}]
set_max_delay 3.87  -to [get_ports {out_data[77]}]
set_max_delay 3.87  -to [get_ports {out_data[76]}]
set_max_delay 3.87  -to [get_ports {out_data[75]}]
set_max_delay 3.87  -to [get_ports {out_data[74]}]
set_max_delay 3.87  -to [get_ports {out_data[73]}]
set_max_delay 3.87  -to [get_ports {out_data[72]}]
set_max_delay 3.87  -to [get_ports {out_data[71]}]
set_max_delay 3.87  -to [get_ports {out_data[70]}]
set_max_delay 3.87  -to [get_ports {out_data[69]}]
set_max_delay 3.87  -to [get_ports {out_data[68]}]
set_max_delay 3.87  -to [get_ports {out_data[67]}]
set_max_delay 3.87  -to [get_ports {out_data[66]}]
set_max_delay 3.87  -to [get_ports {out_data[65]}]
set_max_delay 3.87  -to [get_ports {out_data[64]}]
set_max_delay 3.87  -to [get_ports {out_data[63]}]
set_max_delay 3.87  -to [get_ports {out_data[62]}]
set_max_delay 3.87  -to [get_ports {out_data[61]}]
set_max_delay 3.87  -to [get_ports {out_data[60]}]
set_max_delay 3.87  -to [get_ports {out_data[59]}]
set_max_delay 3.87  -to [get_ports {out_data[58]}]
set_max_delay 3.87  -to [get_ports {out_data[57]}]
set_max_delay 3.87  -to [get_ports {out_data[56]}]
set_max_delay 3.87  -to [get_ports {out_data[55]}]
set_max_delay 3.87  -to [get_ports {out_data[54]}]
set_max_delay 3.87  -to [get_ports {out_data[53]}]
set_max_delay 3.87  -to [get_ports {out_data[52]}]
set_max_delay 3.87  -to [get_ports {out_data[51]}]
set_max_delay 3.87  -to [get_ports {out_data[50]}]
set_max_delay 3.87  -to [get_ports {out_data[49]}]
set_max_delay 3.87  -to [get_ports {out_data[48]}]
set_max_delay 3.87  -to [get_ports {out_data[47]}]
set_max_delay 3.87  -to [get_ports {out_data[46]}]
set_max_delay 3.87  -to [get_ports {out_data[45]}]
set_max_delay 3.87  -to [get_ports {out_data[44]}]
set_max_delay 3.87  -to [get_ports {out_data[43]}]
set_max_delay 3.87  -to [get_ports {out_data[42]}]
set_max_delay 3.87  -to [get_ports {out_data[41]}]
set_max_delay 3.87  -to [get_ports {out_data[40]}]
set_max_delay 3.87  -to [get_ports {out_data[39]}]
set_max_delay 3.87  -to [get_ports {out_data[38]}]
set_max_delay 3.87  -to [get_ports {out_data[37]}]
set_max_delay 3.87  -to [get_ports {out_data[36]}]
set_max_delay 3.87  -to [get_ports {out_data[35]}]
set_max_delay 3.87  -to [get_ports {out_data[34]}]
set_max_delay 3.87  -to [get_ports {out_data[33]}]
set_max_delay 3.87  -to [get_ports {out_data[32]}]
set_max_delay 3.87  -to [get_ports {out_data[31]}]
set_max_delay 3.87  -to [get_ports {out_data[30]}]
set_max_delay 3.87  -to [get_ports {out_data[29]}]
set_max_delay 3.87  -to [get_ports {out_data[28]}]
set_max_delay 3.87  -to [get_ports {out_data[27]}]
set_max_delay 3.87  -to [get_ports {out_data[26]}]
set_max_delay 3.87  -to [get_ports {out_data[25]}]
set_max_delay 3.87  -to [get_ports {out_data[24]}]
set_max_delay 3.87  -to [get_ports {out_data[23]}]
set_max_delay 3.87  -to [get_ports {out_data[22]}]
set_max_delay 3.87  -to [get_ports {out_data[21]}]
set_max_delay 3.87  -to [get_ports {out_data[20]}]
set_max_delay 3.87  -to [get_ports {out_data[19]}]
set_max_delay 3.87  -to [get_ports {out_data[18]}]
set_max_delay 3.87  -to [get_ports {out_data[17]}]
set_max_delay 3.87  -to [get_ports {out_data[16]}]
set_max_delay 3.87  -to [get_ports {out_data[15]}]
set_max_delay 3.87  -to [get_ports {out_data[14]}]
set_max_delay 3.87  -to [get_ports {out_data[13]}]
set_max_delay 3.87  -to [get_ports {out_data[12]}]
set_max_delay 3.87  -to [get_ports {out_data[11]}]
set_max_delay 3.87  -to [get_ports {out_data[10]}]
set_max_delay 3.87  -to [get_ports {out_data[9]}]
set_max_delay 3.87  -to [get_ports {out_data[8]}]
set_max_delay 3.87  -to [get_ports {out_data[7]}]
set_max_delay 3.87  -to [get_ports {out_data[6]}]
set_max_delay 3.87  -to [get_ports {out_data[5]}]
set_max_delay 3.87  -to [get_ports {out_data[4]}]
set_max_delay 3.87  -to [get_ports {out_data[3]}]
set_max_delay 3.87  -to [get_ports {out_data[2]}]
set_max_delay 3.87  -to [get_ports {out_data[1]}]
set_max_delay 3.87  -to [get_ports {out_data[0]}]
set_max_delay 3.87  -to [get_ports out_vld]
set_max_delay 3.87  -to [get_ports mismatch]
set_resistance 0  [get_nets rst_n]
